<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use App\User;
use App\Article;

class ArticlesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $user = User::where('email', 'admin@gmail.com')->first();

        DB::table('articles')->insert([
            [
                'category_id' => 1,
                'user_id' => $user->id,
                'title' => 'Консул: Штибліков виглядає добре, скарг не висловлює',
                'content' => '
                    Політв\'язень Дмитро Штибліков, який з травня 2018 року утримується в одиночній камері у колонії №6 у м.Омськ, заявив, що є громадянином РФ та України, виглядає добре та не висловлює скарг.
                    Про це 16 травня повідомив в.о. консула-керівника Консульства України у Новосибірську Олег Фіногенов, який разом з омбудсменом РФ Тетяною Москальковою відвідав українського політв’язня.
                    "Дмитро Штибліков виглядає добре, скарг не висловлює. Він перебуває з травня 2018 року в одиночній камері. Мав кілька дисциплінарних стягнень", - повідомив Фіногенов.
                    За його словами, він мав розмову зі Штибліковим, під час якої в\'язень написав заяву до Мінюсту України з проханням посприяти переведенню його в Україну для подальшого відбування покарання.',
                'published_at' => null,
                'status' => Article::STATUS_INACTIVE,
            ],

            [
                'category_id' => 1,
                'user_id' => $user->id,
                'title' => 'Аваков назвал новый механизм реинтеграции Донбасса',
                'content' => '
                    Министр внутренних дел Украины Арсен Аваков предлагает ввести режим контрпропаганды на востоных территориях Украины после их деоккупации. Об этом передает пресс-служба МВД.
                    По его словам, необходимо пошагово вернуть доверие жителей Донбасса к украинским властям, а для этого прежде всего стоит поработать в сфере негативного информационного поля, которое сложилось в регионе за долгие годы оккупации. Нам стоит увеличить медиа активность во всех формах - от телевидения до радиовещания, дабы процесс возвращение восточных территорий прошел в мирном русле.  Не исключено, добавил Аваков, что противник попытается прибегнуть к эскалации конфликта в информационном пространстве, но мы должны быть к этому готовы. "Это механизм контрпропаганды, который также должен работать, это борьба за умы людей, которых обманула российская пропаганда", - отмечает глава МВД.
                    Как сообщалось в "УРА-Информ", министр внутренних дел Арсен Аваков считает, что жителям неподконтрольных территорий Донецкой и Луганской областей нужно запретить голосование на парламентских выборах в течении 3-5 лет. По его словам, выборы в местные советы должны состояться сразу же после реинтеграции ОРДЛО, чтобы на этих территориях появилась легитимная украинская власть.  деоккупация  Аваков  Донбасс.',
                'published_at' => null,
                'status' => Article::STATUS_INACTIVE,
            ],

            [
                'category_id' => 1,
                'user_id' => $user->id,
                'title' => 'Голодовка политузника России Олега Сенцова. 34 день: В РФ затягивают процесс посещения омбудсменом удерживаемых в РФ украинцев',
                'content' => '
                    Уполномоченный Верховной Рады Украины по правам человека Людмила Денисова заявляет, что в России происходит процесс затягивания посещения омбудсменом граждан Украины, которые удерживаются на российской территории, - сообщает пресс-служба украинского омбудсмена.

                    Вчера Денисовой так и не удалось посетить украинского политзаключенного Олега Сенцова, который содержится в колонии города Лабытнанги (Тюменская область).

                    "Если были договоренности двух президентов - Петра Порошенко и Владимира Путина - о предоставлении возможности посетить наших граждан в местах несвободы, то надо уменьшить сроки прохождения всех документов. Сегодня происходит такая переписка с нашими консульскими службами, со мной, чтобы затянуть процесс посещения политзаключенных", - комментирует Людмила Денисова.

                    Сегодня она отправляется в город Владимир, где содержится украинец Николай Карпюк.

                    "Мы договорились о визите к Николаю Карпюку еще в четверг. Но сегодня, когда мы вернулись из города Салихард, наше посольство получило письмо, якобы они не успевают согласовать процедуры согласно Консульской конвенции. Поэтому представители консульства не смогут встретиться с Николаем Карпюком", - рассказала омбудсмен.

                    По ее словам, в письме не было ничего написано о ней как Уполномоченном по правам человека.

                    "Поэтому мы едем и будем подавать заявление в соответствии со ст. 89 п. 4 Уголовно-исполнительного кодекса РФ. На таких условиях российским законодательством предусмотрена возможность визита к Николаю Карпюку", - отмечает Денисова.

                    Она также подтвердила, что на понедельник, 18 июня, запланирована встреча с уполномоченным по правам человека РФ Татьяной Москальковой в ее офисе.

                    Омбудсмены будут согласовывать "дорожную карту" визитов.

                    "Я хочу, чтобы моя коллега Татьяна Москалькова понимала, что если мы таким образом будем выполнять высокие политические договоренности, то я не знаю, за какое время мы посетим всех политзаключенных. Я очень волнуюсь, что нам вчера не удалось увидеться с Олегом Сенцовым и выяснить, какое сейчас его состояние здоровья. Потому что он уже 34-й день голодает. У меня есть информация по состоянию на 5 июня. Никаких подтверждений, в каком состоянии он находится сейчас, ни у Татьяны Москальковой, ни у меня нет. Отказ в моем посещении Олега Сенцова был очень жестким", - говорит Людмила Денисова.

                    Уполномоченная напомнила, что, кроме Олега Сенцова, есть и другие украинские политзаключенные, которые голодают: Владимир Балух - 90-й день, Александр Шумков - 24-й день, Станислав Клих - 9-й день.

                    "Мы хотим попасть к ним, чтобы выполнить нашу гуманитарную миссию. Я думаю, что Татьяна Москалькова и все другие органы, которые причастны к выполнению высоких договоренностей наших президентов, должны ускорить свои действия", - подчеркнула Денисова.

                    Олег Сенцов родился в Симферополе. В 2011 году снял свой первый фильм "Гамер". Премьера состоялась в симферопольском кинотеатре "Космос" и собрала полный зал зрителей. Кинокартина была представлена на Роттердамском кинофестивале. Фильм был награждён призом Гильдии киноведов и кинокритиков на фестивале "Дух огня" в Ханты-Мансийске. На 3-м Одесском международном кинофестивале картина Сенцова была удостоена специального диплома жюри. В мае 2012 года "Гамер" получил приз в 1 тысячу долларов США на 3-м международном кинофестивале в Трускавце. В июле 2013 года Сенцов приступил к съёмкам нового фильма "Носорог" про детей 1990-х годов.

                    С началом Революции Достоинства Олег Сенцов стал активистом Автомайдана. Во время крымского кризиса поддерживал движение за единую Украину, покупал и развозил продукты и предметы первой необходимости украинским воинским частям в Крыму, которые были заблокированы. 11 мая 2014 года Сенцов вышел на акцию протеста в Симферополе, позже в этот день он был задержан Федеральной службой безопасности Российской Федерации по подозрению в терроризме.

                    30 мая 2014 года ФСБ сообщила о задержании Сенцова и ещё троих подозреваемых. По версии ФСБ, основной целью подозреваемых было совершение диверсионно-террористических актов в Симферополе, Севастополе и Ялте.

                    25 августа 2015 года Северо-Кавсказкий окружной военный суд приговорил Сенцова к 20 годам лишения свободы с отбыванием в колонии строгого режима.

                    Сейчас Сенцов содержится в колонии "Белый медведь" в городе Лабытнанги. 14 мая 2018 года режиссер объявил бессрочную голодовку с требованием освобождения всех украинских политзаключенных в России.
                    Украинец заявил, что или он погибнет, или его требования начнут выполнять. По словам адвоката, собственного освобождения он не требует.
                    Посольство США в Украине выражает поддержку удерживаемому в России украинскому режиссеру Олегу Сенцову.
                    Президент Украины Петр Порошенко заявил, что Украина делает все, чтобы обеспечить давление на главу российского государства Владимира Путина, чтобы он дал поручение продолжить процесс возвращения украинских политзаключенных, незаконно удерживаемых на территории РФ.
                    Сейчас более 60 украинцев, в том числе крымских татар, незаконно удерживаются по безосновательным и политически мотивированным обвинениям в Российской Федерации и Крыму. На территории Донбасса Российская Федерация удерживает 100 заложников.',
                'published_at' => date('Y-m-d H:i:s'),
                'status' => Article::STATUS_ACTIVE,
            ],

            [
                'category_id' => 1,
                'user_id' => $user->id,
                'title' => 'Канада послідовно підтримує наші територіальну цілісність і суверенітет.',
                'content' => '
                    Під час візиту парламентської делегації групи дружби між Україною та Канадою до Канади відбулася зустріч Першого заступника Голови Верховної Ради України Ірини Геращенко із радником Прем’єр-міністра К.',
                'published_at' => date('Y-m-d H:i:s'),
                'status' => Article::STATUS_ACTIVE,
            ],

            [
                'category_id' => 2,
                'user_id' => $user->id,
                'title' => 'Фокус в деталях. Поради щодо фотографії в режимі апертури',
                'content' => '
                    В рамках спецпроекту про фотографію, НВ представляє другий із серії матеріалів про різні види фотозйомки. У цій статті ми розберемося, що таке режим апертури на камері смартфона і як правильно ним користуватися.

                    Технології сучасної фототехніки, певною мірою, розбестили рядового фотографа. Ще кілька десятків років тому наявність навіть звичайнісінької аматорської камери зобов\'язувала її власника розбиратися в тому, що таке пентапризма, експонометр, фокальний затвор, не кажучи вже про різні види і характеристики фотоплівки.

                    Сьогодні ж цифрові інновації дозволяють робити хороші фотографії будь-якій людині, навіть без найменшого уявлення про те, як функціонує її камера.

                    Хоча, знання того, як відбувається процес фотографії та що на нього впливає, все ж, покращує вашу пристосованість до зйомки в різних умовах, і неодмінно позначиться на кінцевому результаті.

                    Щоб зрозуміти, як функціонує апертура, а точніше - апертура діафрагми камери, варто вивчити будову людського ока. Адже принцип роботи фототехніки скопійований саме з органів зору людини.

                    Кришталик ока відповідає лінзі об\'єктиву, крізь яку ми дивимося на зображення; зіниця є аналогом апертури діафрагми, яка контролює кількість світла і різкість картинки; і мозок фотоапарата - матриця, - те ж саме, що й сітківка ока, на яку проектується перевернене зображення і інтерпретується нами як навколишня дійсність.

                    Залежно від стану здоров\'я людини, і від характеристик камери, всі ці деталі можуть бути різної якості і мати різні можливості.

                    Апаратура діафрагми контролює кількість світла, яке потрапляє в кадр і відповідає за різкість фотографії в окремих місцях. На жаль, у людського ока цей режим завжди автоматичний, і ми не можемо управляти процесами звуження і розширення зіниці при різній навколишній обстановці.

                    Але в лінзах фотоапаратів і деяких смартфонів, функція апертури піддається налаштуванню і позначається фокусною відстанню F. Чим нижче число F - тим більше відкрита діафрагма і більше світла потрапляє в камеру, і, відповідно, чим вище - тим менше світла зловить ваша камера.',
                'published_at' => null,
                'status' => Article::STATUS_INACTIVE,
            ],

            [
                'category_id' => 2,
                'user_id' => $user->id,
                'title' => 'Інсталяції на вулицях і опера під звук Ан-2. В Івано-Франківську відкрився фестиваль Porto Franko.',
                'content' => '
                    У четвер, 14 червня, в Івано-Франківську пройшло офіційне відкриття найбільшого арт-фестивалю західної України - Porto Franko. І хоча перші виставки та вистави були показані напередодні, 13 червня, масштабне шоу Аерофонія урочисто дало старт великій п\'ятиденній програмі.

                    Цього року шоу відкриття - футуристичну оперу з використанням літака Ан-2, світлових ефектів, вантажної техніки та елементів флешмобу - показали на стадіоні Рух. Для Аерофонії головну декорацію і «музичний інструмент», легендарний Ан-2, заздалегідь привезли на локацію.

                    Крім вражаючого хедлайнера в Аерофонії також були задіяні вокалісти Нової опери, поет і прозаїк Юрій Іздрик, який під музику читав свої твори, а також десятки людей, одягнених в однакові жовті дощовики.

                    Також в цей день Porto Franko можна було відвідати лекцію засновниці Дикого театру Ярослави Кравченко, виставки у Палаці Потоцьких, зустріти інсталяції, розставлені по місту, або поспівати в центрі міста під знаменитий баян журналіста Богдана Кутєпова.',
                'published_at' => date('Y-m-d H:i:s'),
                'status' => Article::STATUS_ACTIVE,
            ],

            [
                'category_id' => 2,
                'user_id' => $user->id,
                'title' => 'Скільки коштує дошкільник в Австралії. Блог Олександра Чебана',
                'content' => '
                    Кілька років тому наша сім\'я познайомилася з системою Монтессорі, тому мені дуже цікаво побачити, як це працює в різних країнах і містах

                    Montessori Academy заснована в 2000-му році і є провідним провайдером дошкільної освіти та раннього розвитку в Австралії. Тільки в Сіднеї у Montessori Academy більше 20 локацій, також три центри є в Шанхаї. На щастя, кілька років тому наша сім\'я познайомилася з системою Монтессорі, тому мені дуже цікаво побачити, як це працює в різних країнах і містах.

                    Це "long-day childcare center", який приймає дітей з 7.00 до 19.00. Є три вікові групи: infants (6 тижнів – 2 роки), toddlers (2-3,5 року), preschollers (3,5-6).

                    Згідно із законодавством роботодавець гарантує збереження робочого місця для жінки протягом двох років після народження дитини. Поняття "оплачувана декретна відпустка" варіюється залежно від роботодавця. Наприклад, у Qantas це 12 тижнів, що дуже непогано.

                    Зазвичай після досягнення віку 8-10 тижнів багато мам виходять на роботу, тому дітей приймають навіть з 6 тижнів.

                    Центр, в якому побував я, розташований у бізнес-даунтауні, тому дуже зручний для батьків, але недоліком є ​​дуже обмежений простір. Тут використовується кожен квадратний метр і всі приміщення маленькі. Childacare center розміщений на одному з поверхів багатоповерхового будинку, ліфт піднімає на цей поверх тільки після ідентифікації магнітної картки. Тут немає дворика для прогулянок, як такого, тому частина приміщення перепроектована з відкритою зоною, вийшов величезний балкон, де діти гуляють.

                    Харчування: три основних прийоми їжі, кожен день тижня – це національна кухня якоїсь країни. Також є два-три перекуси (ранковий чай після сніданку, полуденок після обіду).

                    Після традиційного ранкового "кола" відбувається 15-20 хвилинний сеанс дитячої йоги і медитації.

                    У дошкільних установах заборонені горіхи – в Австралії дуже високий рівень алергії на горіхи і їхні продукти.

                    Співвідношення кількості викладачів до учнів: від 1 на 3-4 в інфант-групі до 1 на 6-7 в дошкільній групі. У кожній групі є lead teacher, який керує навчальним процесом і будує програму на день. Не всі викладачі є сертифікованими монтессорі-викладачами, але, як мінімум 1,5-2 години в день кожна дитина займається індивідуально (або в групі до 2-3 дітей) саме з викладачем монтессорі.

                    Протягом дня вчителі обов\'язково фотографують і знімають процес навчання на відео і ввечері кожного дня викладають фото і відео в батьківську групу в інтернеті. Кожен день це 40-60 фотографій, а також кілька відео.

                    На вході в кожну групу є лист, де кожен день відзначається, скільки дитина спала і скільки з\'їла. Деякі з\'їдають по дві-три порції, а деякі нічого не їдять. Ніхто нікого не змушує.

                    Вартість: 160-180 австралійських долари на день (це $120-140), в залежності від вікової групи, оплата кожні два тижні за відвідані дні. У цю вартість все включено.',
                'published_at' => date('Y-m-d H:i:s'),
                'status' => Article::STATUS_ACTIVE,
            ],

            [
                'category_id' => 4,
                'user_id' => $user->id,
                'title' => 'Українська легкоатлетка Стуй виграла з рекордом турнір у Франції і була відібрана на ЧЄ',
                'content' => '
                    Українка показала найкращий результат сезону а також встановила рекорд турніру Стуй виграла легкоатлетичний турнір у Франції в забігу на 100 метрів / facebook.com/kristina.stuy Українська бігунка Христина Стуй виграла легкоатлетичні змагання у Франції. Українка пробігла стометрівку з результатом 11,26 секунд, показавши кращий результат сезону і встановивши рекорд турніру, повідомляє SportArena. Також Стуй виконала норматив чемпіонату Європи, який з 7 по 12 серпня пройде в Берліні. Кілька днів тому спортсменка встановила особистий рекорд, пробігши стометрівку в Греції на 11,20 секунд. Однак цей результат офіційно зафіксовано не було, оскільки під час забігу вітер значно перевищував норму і дув зі швидкістю 4,1 м/с.',
                'published_at' => null,
                'status' => Article::STATUS_INACTIVE,
            ],

            [
                'category_id' => 4,
                'user_id' => $user->id,
                'title' => 'ЧМ-2018: Группа G – Англия, Бельгия и аутсайдеры',
                'content' => '
                    УНИАН продолжает знакомить своих читателей с составом групп и шансами команд на предстоящем чемпионате мира по футболу. И сегодня на очереди предпоследняя Группа G, в которой команды четко поделены на фаворитов и аутсайдеров. Сборные Англии и Бельгии будут оспаривать более удобное с точки зрения плей-офф 1-е место в группе, а вот Панама и Тунис оспорят, разве что, 3-ю строчку турнирной таблицы – без шансов на продолжение борьбы. К этой группе жребий оказался совсем немилосерден с точки зрения интриги. Интересен здесь будет только один матч, в котором Англия и Бельгия оспорят 1-е место. Очная игра Панама-Тунис заинтересует, разве что, самых отчаянных футбольных фанатов, которые из принципа не пропускают ни одного матча ЧМ, а также, разумеется, болельщиков из двух стран. А в остальных четырех играх явными фаворитами будут, соответственно, команды Англии и Бельгии. Вместе с тем, к англичанам и бельгийцам жребий оказался совсем немилосерден уже в плей-офф. В первом же раунде, 1/8 финала, они наверняка попадут на кого-то из пары Польша-Колумбия – фаворитов заключительного квартета Н. Что одна, что другая команда сейчас находятся на большом подъеме и способны на любой сюрприз на предстоящем Мундиале. Собственно, именно Колумбия на предыдущем ЧМ-2014 в Бразилии совершила большой сюрприз, дойдя аж до четвертьфинала. И за последние 4 года команда лишь прибавила в мастерстве, у нее значительно добавилось опыта, она стала намного «острее» и задиристее. Пожалуй, эта команда Колумбии даже сильнее той, которая 4 года назад была относительным новичком на мировой арене. Именно сейчас она в самом соку и готова на новые, еще большие свершения. Возвращаясь же к паре Англия – Бельгия стоит отметить, что бельгийцы не смогли до конца раскрыть свой потенциал ни 4 года назад в Бразилии, ни два года назад на Евро во Франции. Сейчас это уже немного не та команда, которой все восхищались ранее. Время ушло?
                    Ответить на этот вопрос сможет только сам Мундиаль. Но пока, накануне турнира, эксперты и аналитики контор далеко не в восторге от нынешней игровой формы и перспектив команды.',
                'published_at' => date('Y-m-d H:i:s'),
                'status' => Article::STATUS_ACTIVE,
            ]

        ]);
    }
}
